Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: If cString contains ill-formed UTF-8 code unit sequences, this initializer replaces them with the Unicode replacement character ("\u{FFFD}").
ja: cStringが文法的に正しくないUTF-8コードユニットシーケンスを含むならば、それらをある代替文字（"\u{FFFD}"）で置き換えます。

source: If codeUnits is an ill-formed code unit sequence, the result is nil.
ja: codeUnitsが文法的に正しくないコード単位シーケンスを含むならば、結果はnilです。

source: If description is in an invalid format, or if the value it denotes in base 10 is not representable, the result is nil.
ja: descriptionが無効な形式になっているならば、またはそれが底10で示す値が表現可能でないならば、結果はnilです。

source: If distance > 0, limit should be greater than i to have any effect.
ja: distance > 0ならば、limitが何らかの効果を持つにはiより大きくなければなりません。

source: If distance > 0, a limit that is less than i has no effect.
ja: distance > 0ならば、iより少ない限度は効果を持ちません。

source: If end is equal to start, the result is zero.
ja: endがstartに等しいならば、結果はゼロです。

source: If false, an empty subsequence is returned in the result for each consecutive pair of separator elements in the collection and for each instance of separator at the start or end of the collection.
ja: falseならば、このコレクション中の連続するseparator要素の対それぞれに、そしてコレクションの始めと終わりのseparatorインスタンスそれぞれに、１つの空の下位シーケンスが結果において返されます。

source: If false, an empty subsequence is returned in the result for each consecutive pair of separator elements in the sequence and for each instance of separator at the start or end of the sequence.
ja: falseならば、このシーケンス中の連続するseparator要素の対それぞれに、そしてシーケンスの始めと終わりのseparatorインスタンスそれぞれに、１つの空の下位シーケンスが結果において返されます。

source: If false, an empty subsequence is returned in the result for each pair of consecutive elements satisfying the isSeparator predicate and for each element at the start or end of the collection satisfying the isSeparator predicate.
ja: falseならば、結果においてisSeparator述部を満たす隣接する要素のペアそれぞれに対しておよびisSeparator述部を満たすコレクションの始まりまたは終わりでの要素それぞれに対して１つの空の下位シーケンスが返されます。

source: If false, an empty subsequence is returned in the result for each pair of consecutive elements satisfying the isSeparator predicate and for each element at the start or end of the sequence satisfying the isSeparator predicate.
ja: falseならば、結果においてisSeparator述部を満たす隣接する要素のペアそれぞれに対しておよびisSeparator述部を満たすシーケンスの始まりまたは終わりでの要素それぞれに対して１つの空の下位シーケンスが返されます。

source: If from is nil, the result of this initializer is nil.
ja: fromがnilならば、このイニシャライザの結果は、nilです。

source: If hasPointerRepresentation is false, the static string stores a single Unicode scalar value.
ja: hasPointerRepresentationがfalseならば、静的文字列は単一のユニコードスカラー値を格納します。

source: If i is equal to the string’s end index, this methods appends newElement to the string.
ja: iが文字列の末尾インデックスと等しいならば、このメソッドはnewElementを文字列へ追加します。

source: If i is equal to the string’s end index, this methods appends the contents of newElements to the string.
ja: iが文字列の末尾インデックスと等しいならば、このメソッドはnewElementsの内容を文字列へ追加します。

source: If instance conforms to the CustomDebugStringConvertible protocol, the result is instance.debugDescription.
ja: instanceが準拠するのがCustomDebugStringConvertibleプロトコルならば、結果はinstance.debugDescriptionです。

source: If instance conforms to the CustomStringConvertible protocol, the result is instance.description.
ja: instanceが準拠するのがCustomStringConvertibleプロトコルならば、結果はinstance.descriptionです。

source: If instance conforms to the TextOutputStreamable protocol, the result is obtained by calling instance.write(to: s) on an empty string s.
ja: instanceが準拠するのがTextOutputStreamableプロトコルならば、結果はinstance.write(to: s)を空の文字列s上で呼び出すことによって入手されます。

source: If isRepairing is false and an ill-formed sequence is detected, this method returns nil.
ja: isRepairingがfalseで誤形式シーケンスが検出されるならば、このメソッドはnilを返します。

source: If maxSplits + 1 subsequences are returned, the last one is a suffix of the original collection containing the remaining elements.
ja: maxSplits + 1の下位シーケンスが返されるならば、最後のものは、残りの要素を含んでいる元コレクションの後ろ部分です。

source: If maxSplits + 1 subsequences are returned, the last one is a suffix of the original sequence containing the remaining elements.
ja: maxSplits + 1の下位シーケンスが返されるならば、最後のものは、残りの要素を含んでいる元シーケンスの後ろ部分です。

source: If n > 0, a limit that is less than i has no effect.
ja: n > 0ならば、iより少ない限度は効果を持ちません。

source: If other is nil, the result is nil.
ja: otherがnilならば、結果は、nilです。

source: If predicate matches every element in the sequence, the result is an empty sequence.
ja: predicateがシーケンスの中のすべての要素に合致するならば、結果は空のシーケンスです。

source: If predicate matches every element in the sequence, the resulting sequence contains every element of the sequence.
ja: predicateがシーケンスの中のすべての要素に合致するならば、結果のシーケンスはそのシーケンスのすべての要素を含みます。

source: If source contains no elements, the returned index is equal to the buffer’s startIndex.
ja: sourceが全く要素を含まないならば、返されるインデックスはバッファの持つstartIndexと等しいです。

source: If source is outside the bounds of this type after rounding toward zero, a runtime error may occur.
ja: sourceがゼロへの丸め後にこの型の境界の外側ならば、実行時エラーが起こるかもしれません。

source: If starts is nil, count must be zero.
ja: startsがnilならば、countはゼロでなければなりません。

source: If subject conforms to the CustomDebugStringConvertible protocol, the result is subject.debugDescription.
ja: subjectが準拠するのがCustomDebugStringConvertibleプロトコルならば、結果はsubject.debugDescriptionです。

source: If subject conforms to the CustomStringConvertible protocol, the result is subject.description.
ja: subjectが準拠するのがCustomStringConvertibleプロトコルならば、結果はsubject.descriptionです。

source: If subject conforms to the TextOutputStreamable protocol, the result is obtained by calling subject.write(to: s) on an empty string s.
ja: subjectが準拠するのがTextOutputStreamableプロトコルならば、結果はsubject.write(to: s)を空の文字列s上で呼び出すことによって入手されます。

source: If text is in an invalid format or contains characters that are out of bounds for the given radix, or if the value it denotes in the given radix is not representable, the result is nil.
ja: text が無効な形式になっているか指定radixの領域外の文字列を含むならば、または指定radixにおいてそれが意味する値が表現可能でないならば、結果はnilです。

source: If baseAddress is nil, this function does nothing and returns an empty buffer pointer.
ja: baseAddressがnilならば、この関数は何もしません、そして空のバッファポインタを返します。

source: If a and b are incomparable, and b and c are incomparable, then a and c are also incomparable.
ja: aとbが比較できないならば、そしてbとcが比較できないならば、そのときaとcもまた比較できない。

source: If body has a return value, that value is also used as the return value for the withMemoryRebound(to:capacity:_:) method.
ja: bodyが戻り値を持つならば、その値はまたwithMemoryRebound(to:capacity:_:)メソッドの戻り値としても使われます。

source: If element is not found in the collection, returns nil.
ja: elementがコレクションの中に見つけられないならば、nilを返します。

source: If element is not found in the collection, this method returns nil.
ja: elementがコレクションの中に見つけられないならば、このメソッドはnilを返します。

source: If pointer is nil, the result is 0.
ja: pointerがnilならば、結果は0です。

source: If rhs is outside the range 0..<lhs.bitWidth, it is masked to produce a value within that range.
ja: rhsが範囲0..<lhs.bitWidthの外側ならば、それはマスクされてその範囲内の値を生み出します。

source: If start is nil, count must be zero.
ja: startがnilならば、countはゼロでなければなりません。

source: If transform throws an error, the sequence ends.
ja: transformがエラーをスローするならば、そのシーケンスは終わります。

source: If areInIncreasingOrder throws an error during the sort, the elements may be in a different order, but none will be lost.
ja: areInIncreasingOrderがエラーをソートの間にスローするならば、要素は異なる順番になるかもしれません、しかし何１つとしてなくさないでしょう。

source: If distance is positive, this is the same value as the result of distance calls to index(after:).
ja: distanceが正ならば、これはdistanceでindex(after:)を呼び出す結果と同じ値です。

source: If i == endIndex, this method is equivalent to append(_:).
ja: i == endIndexならば、このメソッドはappend(_:)に相当します。

source: If n is positive, this is the same value as the result of n calls to index(after:).
ja: nが正ならば、これはnでindex(after:)を呼び出すの結果と同じ値です。

source: If repairingIllFormedSequences is false and an ill-formed sequence is detected, this method returns nil.
ja: repairingIllFormedSequencesがfalseで誤形式シーケンスが検出されるならば、このメソッドはnilを返します。

source: If repairingIllFormedSequences is true, the entire iterator will be exhausted.
ja: repairingIllFormedSequencesがtrueならば、イテレータ全体が使い尽くされることになります。

source: If source is less than the smallest representable value in this type, the result is the type’s min value.
ja: sourceがこの型の最も小さい表現可能な値より小さいならば、結果はこの型のもつmin値です。

source: If sourcePosition does not have an exact corresponding position in target, then the result is nil.
ja: sourcePositionがtargetの中に正確に対応する位置を持たないならば、そのとき結果はnilです。

source: If baseAddress is nil, this function does nothing.
ja: baseAddressがnilならば、この関数は何もしません。

source: If body has a return value, that value is also used as the return value for the withMemoryRebound(to:_:) method.
ja: bodyが戻り値を持つならば、その値はまたwithMemoryRebound(to:_:)メソッドの戻り値としても使われます。

source: If source contains an equal or greater number of elements than the buffer can hold, the returned index is equal to the buffer’s endIndex.
ja: sourceがバッファが保持できるのと同じまたはより多い数の要素を含むならば、返されるインデックスはバッファの持つendIndexと等しいです。

source: If true, only nonempty subsequences are returned.
ja: trueならば、空でない下位シーケンスだけが返されます。

source: If possiblePrefix has no elements, the return value is true.
ja: possiblePrefixが１つも要素を持たないならば、戻り値はtrueです。

source: If T is a nontrivial type, you must eventually deinitialize or move from the values in this region to avoid leaks.
ja: Tが非自明型ならば、あなたはゆくゆくはデイニシャライズするかまたはこの領域の値から移動してリークを防がなければなりません。

source: If distance is negative, this is the same value as the result of abs(distance) calls to index(before:).
ja: distanceが負ならば、これはabs(distance)でindex(before:)を呼び出す結果と同じ値です。

source: If n is negative, this is the same value as the result of -n calls to index(before:).
ja: nが負ならば、これは-nがindex(before:)を呼び出すの結果と同じ値です。

source: If v is an invalid unicode scalar value, the result is nil.
ja: vが無効なユニコードスカラー値であるならば、結果はnilです。

source: If i == endIndex, this method is equivalent to append(contentsOf:).
ja: i == endIndexならば、このメソッドはappend(contentsOf:)に相当します。

source: If v is an invalid Unicode scalar value, the result is nil.
ja: vが無効なユニコードスカラー値であるならば、結果はnilです。

source: If T is a nontrivial type, you must eventually deinitialize or move the values in this region to avoid leaks.
ja: Tが非自明型ならば、あなたはゆくゆくはデイニシャライズするかまたはこの領域の値を移動してリークを防がなければなりません。

source: If a scalar has no alias, this property is nil.
ja: あるスカラーがエイリアスを持たないならば、このプロパティはnilです。

source: If a task completes by throwing an error, no further task results are returned.
ja: タスクがエラーをスローすることによって完了するならば、その先のタスク結果は返されません。

source: If a type conforming to Strideable is its own Stride type, it must provide concrete implementations of the two operators to avoid infinite recursion.
ja: Strideableに準拠する型は独自のStride型です、それは２つの演算子の具体的な実装を提供して無限再帰を防止しなければなりません。

source: If any are found, the result of the initializer is nil.
ja: 何か見つけられるならば、イニシャライザの結果はnilです。

source: If it contains a .success value, the continuation returns that value; otherwise, it throws the .error value.
ja: それが.success値を含むならば、継続はその値を返します；そうでなければ、それは.error値をスローします。

source: If mutations need to invalidate indices in your custom collection type, don’t use Slice as its subsequence type.
ja: 変異体がインデックスを無効にすることがあなたのあつらえのコレクション型において必要ならば、Sliceをそれの下位シーケンス型として使わないでください。

source: If necessary, the byte order of this value is reversed from the typical byte order of this integer type.
ja: 必要ならば、この値のバイト順はこの整数型の典型的なバイト順からひっくり返されます。

source: If nil, the priority will come from Task.currentPriority.
ja: nil ならば、優先度は Task.currentPriority からくるでしょう。

source: If no current Task is available, queries the system to determine the priority at which the current function is running.
ja: 現在のTaskが利用可能でないならば、システムに問いただして、それで現在の関数が動作しているところの優先度を決定してください。

source: If no current Task is available, returns false, as outside of a task context no task cancellation may be observed.
ja: 現在のTaskが利用可能でないならば、falseを返します、タスク文脈の範囲を越えるときタスク取り消しは監視されないかもしれません。

source: If no current task is available in the context where this call is made, or if the task-local has no value bound, this will return the defaultValue of the task local.
ja: 現在のタスクがこの呼び出しが作られるところの文脈において利用可能でないならば、またはタスクローカルが値をバインドされないならば、これはタスクローカルのdefaultValueを返すでしょう。

source: If no elements in the collection match belongsInSecondPartition, the returned index is equal to the collection’s endIndex.
ja: コレクションの中の要素が１つもbelongsInSecondPartitionに一致しないならば、返されるインデックスはコレクションのendIndexと等しいです。

source: If no elements in the collection satisfy the given predicate, returns nil.
ja: コレクションの要素が与えられた述部を満たすことがないならば、nilを返します。

source: If no such storage exists, it is first created.
ja: そのようなストレージが存在しないならば、それが最初に作成されます。

source: If the baseAddress of this buffer is nil, the count is zero.
ja: このバッファのbaseAddressがnilならば、総数はゼロです。

source: If the byteCount bytes of memory referenced by this pointer are bound to a type T, then T must be a trivial type, this pointer and source must be properly aligned for accessing T, and byteCount must be a multiple of MemoryLayout<T>.stride.
ja: このポインタによって参照されるメモリのbyteCountバイトが型Tに束縛されるならば、そのときTは自明型でなければならず、このポインタとsourceはTにアクセスするために適切にアラインされなければならず、そしてbyteCountはMemoryLayout<T>.strideの倍数でなければなりません。

source: If the overflow component is false, the partialValue component contains the entire difference.
ja: overflow構成部分がfalseならば、partialValue構成部分は差そのままを含みます。

source: If the overflow component is false, the partialValue component contains the entire product.
ja: overflow構成部分がfalseならば、partialValue構成部分は積そのままを含みます。

source: If the overflow component is false, the partialValue component contains the entire quotient.
ja: overflow構成部分がfalseならば、partialValue構成部分は全体の商を含みます。

source: If the overflow component is false, the partialValue component contains the entire remainder.
ja: overflow構成部分がfalseならば、partialValue構成部分は余りそのままを含みます。

source: If the overflow component is false, the partialValue component contains the entire sum.
ja: overflow構成部分がfalseならば、partialValue構成部分は合計そのままを含みます。

source: If the source.count bytes of memory referenced by this buffer are bound to a type T, then T must be a trivial type, the underlying pointer must be properly aligned for accessing T, and source.count must be a multiple of MemoryLayout<T>.stride.
ja: このバッファによって参照されるメモリのsource.countバイトが型Tに束縛されるならば、そのときTは自明型でなければならず、基盤となるポインタはTにアクセスするために適切にアラインされなければならず、そしてsource.countはMemoryLayout<T>.strideの倍数でなければなりません。

source: If the overflow component is true, an overflow occurred and the partialValue component contains either the truncated quotient or, if the quotient is undefined, the dividend.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こった、そしてpartialValue構成部分は切り詰められた商または、商が未定義ならば、被除数のどちらかを含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains the truncated product of this value and rhs.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こるとpartialValue構成部分はこの値とrhsの積の切り詰められたものを含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains the truncated result of rhs subtracted from this value.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こるとpartialValue構成部分はこの値からrhsを減算した結果の切り詰められたもの含みます。

source: If the overflow component is true, an overflow occurred and the partialValue component contains the truncated sum of this value and rhs.
ja: overflow構成部分がtrueであるならば、オーバーフローが起こるとpartialValue構成部分はこの値とrhsの合計の切り詰められたものを含みます。

source: If the overflow component is true, an overflow occurred during division and the partialValue component contains either the entire remainder or, if the remainder is undefined, the dividend.
ja: overflow構成部分がtrueであるならば、除算の間にオーバーフローが起こった、そしてpartialValue構成部分は余りそのまままたは、余りが未定義ならば、被除数のどちらかを含みます。

source: If the UTF-8 view is empty, startIndex is equal to endIndex.
ja: UTF-8ビューが空ならば、startIndexはendIndexと等しいです。

source: If the Unicode replacement character U+FFFD is representable in this encoding, encodedReplacementCharacter encodes that scalar value.
ja: ユニコード代用文字 U+FFFD がこの符号化で表現可能ならば、encodedReplacementCharacterがこのスカラー値を符号化します。

source: If the asynchronous sequence is empty, this method returns true.
ja: 非同期シーケンスが空ならば、このメソッドはtrueを返します。

source: If the awaited on task gets cancelled externally the get() will throw a cancellation error.
ja: それに関して待機されるところのタスクが外部的に取り消されるならばget()は取り消しエラーをスローするでしょう。

source: If the bit width of the shifted integer type is a power of two, masking is performed using a bitmask; otherwise, masking is performed using a modulo operation.
ja: シフトされる整数型のビット幅が２の冪ならば、マスクはビットマスクを使って実行されます；そうでなければ、マスクはモジュロ演算を使って実行されます。

source: If the call to replaceSubrange(_:with:) simply removes elements at the end of the string, the complexity is O(n), where n is equal to bounds.count.
ja: replaceSubrange(_:with:)への呼び出しが単に要素を文字列の終わりから削除するだけならば、計算量はO(n)です、ここでnはbounds.countと等しいです。

source: If the call to replaceSubrange(_:with:) simply removes text at the end of the string, the complexity is O(n), where n is equal to bounds.count.
ja: replaceSubrange(_:with:)への呼び出しが単にテキストを文字列の終わりから削除するだけならば、計算量はO(n)です、ここでnはbounds.countと等しいです。

source: If the call to this method simply appends the contents of newElements to the collection, the complexity is O(m).
ja: このメソッドへの呼び出しが単にnewElementsの内容をコレクションに追加するだけならば、計算量はO(m)です。

source: If the call to this method simply appends the contents of newElements to the collection, this method is equivalent to append(contentsOf:).
ja: このメソッドへの呼び出しが単にnewElementsの内容をコレクションに追加するだけならば、このメソッドはappend(contentsOf:)と等しいです。

source: If the closure has a return value, that value is also used as the return value of the withUTF8Buffer(_:) method.
ja: クロージャが戻り値を持つならば、その値はまたwithUTF8Buffer(_:)メソッドの戻り値としても使われます。

source: If the collection does not have sufficient capacity for another element, additional storage is allocated before appending newElement.
ja: コレクションが別の要素に対して十分な容量を持たないならば、追加のストレージがnewElementを追加する前に割り当てられます。

source: If the collection does not support an internal representation in a form of contiguous storage, body is not called and nil is returned.
ja: コレクションがある内部表現を隣接ストレージの形式でサポートしないならば、bodyは呼び出されません、そしてnilが返されます。

source: If the collection does not support an internal representation in a form of mutable contiguous storage, body is not called and nil is returned.
ja: コレクションがある内部表現を可変の隣接ストレージの形式でサポートしないならば、bodyは呼び出されません、そしてnilが返されます。

source: If the collection is empty, endIndex is equal to startIndex.
ja: コレクションが空ならば、endIndexはstartIndexと等しいです。

source: If the collection is empty, startIndex is equal to endIndex.
ja: コレクションが空ならば、startIndexはendIndexと等しいです。

source: If the collection is empty, the method returns nil.
ja: コレクションが空ならば、このメソッドはnilを返します。

source: If the collection is empty, the value of this property is nil.
ja: コレクションが空であるならば、このプロパティはnilです。

source: If the content of the file path isn’t a well-formed UTF-8 string, this initializer removes invalid bytes or replaces them with U+FFFD.
ja: ファイルパスの内容が整形式UTF-8文字列でないならば、このイニシャライザは不正なバイトそれらを取り除きます、またはそれらをU+FFFDと置き換えます。

source: If the contents of the file path isn’t a well-formed UTF-8 string, this initializer returns nil.
ja: ファイルパスの内容が整形式UTF-8文字列でないならば、このイニシャライザはnilを返します。

source: If the continuation has already resumed, then calling this method results in undefined behavior.
ja: 継続が既に再開してしまっているならば、そのときこの関数を呼び出すことは未定義の挙動という結果になります。

source: If the count passed to prefix(_:) exceeds the number of elements in the base sequence, the result contains all of the elements in the sequence.
ja: prefix(_:)に渡されるcountが基底シーケンスの中の要素の数を越えるならば、結果はそのシーケンスの要素のすべてを含みます。

source: If the index passed as sourcePosition doesn’t have an exact corresponding position in target, the result of the initializer is nil.
ja: sourcePositionとして渡されたインデックスがまさにその対応する位置をtargetにおいて持たないならば、イニシャライザの結果はnilです。

source: If the index passed as sourcePosition doesn’t have an exact corresponding position in unicodeScalars, the result of the initializer is nil.
ja: sourcePositionとして渡されたインデックスがまさにその対応する位置をunicodeScalarsにおいて持たないならば、イニシャライザの結果はnilです。

source: If the index passed as sourcePosition represents either the start of a Unicode scalar value or the position of a UTF-16 trailing surrogate, then the initializer succeeds.
ja: sourcePositionとして渡されるインデックスがユニコードスカラー値の始まりまたはUTF-16後続サロゲートの位置のどちらかを表すならば、イニシャライザはうまくいきます。

source: If the index passed as sourcePosition represents the start of an extended grapheme cluster—the element type of a string—then the initializer succeeds.
ja: sourcePositionとして渡されるインデックスが拡張書記素クラスタ — ある文字列の要素型 — の始まりを表すならば、そのときイニシャライザは成功します。

source: If the maximum length exceeds the number of elements in the collection, the result contains all the elements in the collection.
ja: 最大長がコレクションの要素の数を越えるならば、結果はコレクションの要素すべてを含みます。

source: If the maximum length exceeds the number of elements in the collection, the result contains the entire collection.
ja: 最大長がコレクションの要素の数を越えるならば、結果はコレクション全体を含みます。

source: If the maximum length exceeds the number of elements in the sequence, the result contains all the elements in the sequence.
ja: 最大長がシーケンスの要素の数を越えるならば、結果はシーケンスの要素すべてを含みます。

source: If the memory is bound to a type U that is layout compatible with T, then it contains a value of type U.
ja: メモリが型UでTとレイアウト互換であるものに束縛されるならば、そのときそれは型Uの値を含みます。

source: If the memory is bound to type T, then it contains values of type T.
ja: メモリが型Tに束縛されるならば、そのときそれは型Tの値を含みます。

source: If the memory is uninitialized, it is still uninitialized after being bound to T.
ja: メモリが未初期化であるならば、それはTに束縛された後も依然として未初期化です。

source: If the next child task throws an error and you propagate that error from this method out of the body of a TaskGroup.withThrowingTaskGroup(of:returning:body:) call, then all remaining child tasks in that group are implicitly canceled.
ja: 次の子タスクがエラーをスローするそしてあなたがそのエラーをこのメソッドからTaskGroup.withThrowingTaskGroup(of:returning:body:)呼び出しの本体の外に伝播するならば、そのときそのグループの中の全ての残っている子タスクは暗黙的に取り消されます。

source: If the next child task throws an error and you propagate that error from this method out of the body of a ThrowingTaskGroup.withThrowingTaskGroup(of:returning:body:) call, then all remaining child tasks in that group are implicitly canceled.
ja: 次の子タスクがエラーをスローするそしてあなたがそのエラーをこのメソッドからThrowingTaskGroup.withThrowingTaskGroup(of:returning:body:)呼び出しの本体の外に伝播するならば、そのときそのグループの中の全ての残っている子タスクは暗黙的に取り消されます。

source: If the number of elements is unknown, the value is nil.
ja: 要素の数が未知ならば、値はnilです。

source: If the number of elements to drop exceeds the number of elements in the collection, the result is an empty subsequence.
ja: 省かれることになる要素の数がコレクションの要素の数を越えるならば、結果は空の下位シーケンスです。

source: If the number of elements to drop exceeds the number of elements in the sequence, the result is an empty sequence.
ja: 取り除く要素の数がシーケンスの要素数を越えるならば、結果は空のシーケンスです。

source: If the operation fails the handle will throw the error the operation has thrown when awaited on.
ja: 演算が失敗するならばこのハンドルは、演算は待機される時にスローしたというエラーをスローします。

source: If the position passed in utf16Index doesn’t have an exact corresponding position in utf8, the result of the initializer is nil.
ja: utf16Indexに渡された位置がまさにその対応する位置をutf8において持たないならば、イニシャライザの結果はnilです。

source: If the quotient of dividing dividend by this value is too large to represent in the type, a runtime error may occur.
ja: dividendをこの値で除算した商がこの型で表すのに大きすぎるならば、実行時エラーが起こります。

source: If the result of advancing by n is not representable as a value of this type, then a runtime error may occur.
ja: nだけ前進する結果がこの型の値として表現可能でないならば、実行時エラーが起こるでしょう。

source: If the same task-local is bound multiple times, be it in the same task, or in specific child tasks, the “more specific” binding is returned when the value is read.
ja: 同じタスクローカルが複数回バインドされる、それが同じタスクにおいてする、または特定の子タスクにおいて、ならば、“より具体的な” バインディングが値が読み出される時に返されます。

source: If the sequence has no elements, nextPartialResult is never executed and initialResult is the result of the call to reduce(_:_:).
ja: シーケンスが１つも要素を持たないならば、nextPartialResultは決して実行されません、そしてinitialResultはreduce(_:_:)への呼び出しの結果となります。

source: If the sequence has no elements, updateAccumulatingResult is never executed and initialResult is the result of the call to reduce(into:_:).
ja: シーケンスが１つも要素を持たないならば、updateAccumulatingResultは決して実行されません、そしてinitialResultはreduce(into:_:)への呼び出しの結果となります。
